CodeIgniter4-develop/app/Models/UserModel.php

SELECT *
FROM `users`
WHERE `email` = 'collaborator1@wis4.pt'
 LIMIT 1
---
    public function authenticate(string $email, string $password): ?array
    {
        $user = $this->where('email', $email)->first();

SELECT *
FROM `users`
WHERE `role` = 'collaborator'
---
    public function getUsersByRole(string $role): array
    {
        return $this->where('role', $role)->findAll();