CodeIgniter4-develop/app/Controllers/TaskExecutionController.php

SELECT *
FROM `tasks`
WHERE `tasks`.`id` = '11'
---
    public function submit()
    {
        $authCheck = $this->checkAuthentication();
        if ($authCheck) return $authCheck;

        $collaboratorCheck = $this->checkCollaboratorRole();
        if ($collaboratorCheck) return $collaboratorCheck;

        $taskId = $this->request->getPost('task_id');
        $description = $this->request->getPost('description');
        $file = $this->request->getFile('file');

        if (!$taskId || !$description) {
            return $this->fail('Task ID and description are required');
        }

        $collaboratorId = session()->get('user_id');

        $task = $this->taskModel->find($taskId);

SELECT *
FROM `task_execution`
WHERE `task_execution`.`id` = '13'
---
    public function downloadFile($executionId = null)
    {
        $authCheck = $this->checkAuthentication();
        if ($authCheck) return $authCheck;

        if (!$executionId) {
            return $this->fail('Execution ID is required');
        }

        $execution = $this->taskExecutionModel->find($executionId);