CodeIgniter4-develop/app/Controllers/TaskController.php

SELECT *
FROM `users`
WHERE `users`.`id` = '2'
---
    public function create()
    {
        log_message('info', '========== CREATE TASK STARTED ==========');

        $authCheck = $this->checkAuthentication();
        if ($authCheck) {
            log_message('error', 'Authentication failed');
            return $authCheck;
        }

        $adminCheck = $this->checkAdminRole();
        if ($adminCheck) {
            log_message('error', 'Admin role check failed');
            return $adminCheck;
        }

        $userId = $this->request->getPost('user_id');
        $taskType = $this->request->getPost('task_type');
        $description = $this->request->getPost('description');

        log_message('info', 'Received data - user_id: ' . $userId . ', task_type: ' . $taskType . ', description length: ' . strlen($description));

        if (!$userId || !$taskType || !$description) {
            log_message('error', 'Missing required fields');
            return $this->fail('User ID, task type, and description are required');
        }

        $user = $this->userModel->find($userId);

INSERT INTO `tasks` (`user_id`, `task_type`, `description`, `status`, `created_at`, `updated_at`) VALUES ('2', 'muaiad', 'The description field must be at least 10 characters in length.', 'pending', '2025-10-06 22:12:11', '2025-10-06 22:12:11')
---

        log_message('info', 'Attempting to insert task: ' . json_encode($taskData));

        $insertResult = $this->taskModel->insert($taskData);

SELECT *
FROM `tasks`
WHERE `tasks`.`id` = 11
---
            $taskId = $this->taskModel->getInsertID();
            log_message('info', 'Task inserted with ID: ' . $taskId);

            $task = $this->taskModel->find($taskId);

SELECT `tasks`.*, `users`.`name` as `user_name`, `users`.`email` as `user_email`, `task_execution`.`id` as `execution_id`, `task_execution`.`file_name` as `execution_file_name`, `task_execution`.`file_path` as `execution_file_path`, `task_execution`.`description` as `execution_description`, `task_execution`.`status` as `execution_status`
FROM `tasks`
JOIN `users` ON `users`.`id` = `tasks`.`user_id`
LEFT JOIN `task_execution` ON `task_execution`.`task_id` = `tasks`.`id`
WHERE `tasks`.`id` = '13'
---
    public function show($id = null)
    {
        $authCheck = $this->checkAuthentication();
        if ($authCheck) return $authCheck;

        if (!$id) {
            return $this->fail('Task ID is required');
        }

        // Join with task_execution to get file information
        $task = $this->taskModel
                    ->select('tasks.*, users.name as user_name, users.email as user_email,
                             task_execution.id as execution_id,
                             task_execution.file_name as execution_file_name,
                             task_execution.file_path as execution_file_path,
                             task_execution.description as execution_description,
                             task_execution.status as execution_status')
                    ->join('users', 'users.id = tasks.user_id')
                    ->join('task_execution', 'task_execution.task_id = tasks.id', 'left')
                    ->find($id);